/*
Задание 2_1
Написать функцию isPowerOfTwo, которая указывает, является ли аргумент степенью двойки. Возвращает true или false. Реализовать с помощью рекурсии. Пример:
isPowerOfTwo(1024); // true
isPowerOfTwo(1023); // false
Задание 2_2
Написать функцию increment, которая возвращает аргумент увеличеный на еденицу и количество вызовов функции. Сделать с помощью замыкания, в глобальной области видимости должна быть только переменная increment. Пример:
increment(10); // { value: 11, calls: 1}
increment(14); // { value: 15, calls: 2}
*/